dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/stm32f2xx_1212.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */   

/** 
  * @brief Analog to Digital Converter  
  */

typedef union
{
	struct
	{
	  __IO uint32_t SR;     /*!< ADC status register,                         Address offset: 0x00 */
	  __IO uint32_t CR1;    /*!< ADC control register 1,                      Address offset: 0x04 */      
	  __IO uint32_t CR2;    /*!< ADC control register 2,                      Address offset: 0x08 */
	  __IO uint32_t SMPR1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
	  __IO uint32_t SMPR2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
	  __IO uint32_t JOFR1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
	  __IO uint32_t JOFR2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
	  __IO uint32_t JOFR3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
	  __IO uint32_t JOFR4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
	  __IO uint32_t HTR;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
	  __IO uint32_t LTR;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
	  __IO uint32_t SQR1;   /*!< ADC regular sequence register 1,             Address offset: 0x2C */
	  __IO uint32_t SQR2;   /*!< ADC regular sequence register 2,             Address offset: 0x30 */
	  __IO uint32_t SQR3;   /*!< ADC regular sequence register 3,             Address offset: 0x34 */
	  __IO uint32_t JSQR;   /*!< ADC injected sequence register,              Address offset: 0x38*/
	  __IO uint32_t JDR1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
	  __IO uint32_t JDR2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
	  __IO uint32_t JDR3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
	  __IO uint32_t JDR4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
	  __IO uint32_t DR;     /*!< ADC regular data register,                   Address offset: 0x4C */
	};

	struct
	{
		union {
			vu32 Data;
			struct {
				vu32 AWD		:1;	// Analog watchdog flag: 0: No Analog watchdog event occured
									// 						 1: Analog Watchdog event occured
				vu32 EOC		:1;	// End of converstion	 0: conversion is not complete
									//						 1: conversion complete
				vu32 JEOC		:1;	// injected channel end of conversion			
				vu32 JSTRT		:1;	// injected channel start flag: 0: No Injected group converstion started
									//								1: Injected group converstion has started
				vu32 STRT		:1;	// Regular channel start flag
				vu32 OVR		:1;	

			};
		}SR;	// ADC Status Register

		union {
			vu32 Data;
			struct {
				vu32 AWDCH		:5;	// Analog watchdog channel select bit
				vu32 EOCIE		:1;	// interrupt enable EOC
				vu32 AWDIE		:1; // Analog watchdog interrupt enable
				vu32 JEOCIE		:1; // interrup enable for injected channels
				vu32 SCAN		:1;	// scan mode
				vu32 AWDSGL		:1;	// Enable the watchdog on a single channel in scan mode
				vu32 JAUTO		:1; // automatic injected group conversion
				vu32 DISCEN		:1; // Discontinuous mode on regular channel
				vu32 DISCENJ	:1;	// discontinuous mode on injected channel
				vu32 DISCNUM	:3;	// discontinuous mode channel count
				vu32			:6;
				vu32 AWDENJ		:1;	// Analog watchdog enable on injected channels
				vu32 AWDEN		:1;	// Analog watchdog enable on regular channels
				vu32 RES		:2;
				vu32 OVRIE		:1;
				
			};
		} CR1;	// ADC control Register 1

		union {
			vu32 Data;
			struct {
				vu32 ADON		:1;	// A/D converter ON/OFF
				vu32 CONT		:1;	// Continous conversion
				vu32			:6;	// 
				vu32 DMAMODE	:1;	// Direct Memory access mode
				vu32 DDS   		:1;
				vu32 EOCS  		:1;
				vu32 ALIGN		:1;	// Data Alignment
				vu32			:4;	// 
				vu32 JEXTSEL	:4;	// external event select for injected group
				vu32 JEXTEN		:2;	// External Trigger conversion mode for injected channels
				vu32 SWSTARTJ	:1;	// Start conversion of injected channel
				vu32			:1;	// 
				vu32 EXTSEL		:4;	// External Trigger select for regular group
				vu32 EXTEN		:2;	// External Trigger conersion mode for regular channels
				vu32 SWSTART	:1;	// Start Conversion of regular channel
				vu32 			:1;	// Temerature Sensor and V(REFINT) Enable
			};
		} CR2;	// ADC control Register 2

		union {
			vu32 Data;
			struct {
				vu32 SMP10		:3;
				vu32 SMP11		:3;
				vu32 SMP12		:3;
				vu32 SMP13		:3;
				vu32 SMP14		:3;
				vu32 SMP15		:3;
				vu32 SMP16		:3;
				vu32 SMP17		:3;
				vu32 SMP18		:3;
			};
		} SMPR1;	// ADC sample time register 1(ADC_SMPR1)

		union {
			vu32 Data;
			struct {
				vu32 SMP0		:3;
				vu32 SMP1		:3;
				vu32 SMP2		:3;
				vu32 SMP3		:3;
				vu32 SMP4		:3;
				vu32 SMP5		:3;
				vu32 SMP6		:3;
				vu32 SMP7		:3;
				vu32 SMP8		:3;
				vu32 SMP9		:3;
			};
		} SMPR2;	// ADC sample time register 2(ADC_SMPR2)
		vu32 JOFR1;
		vu32 JOFR2;
		vu32 JOFR3;
		vu32 JOFR4;
		vu32 HTR;
		vu32 LTR;
		union {
			vu32 Data;
			struct {
				vu32 SQ13		:5;
				vu32 SQ14		:5;
				vu32 SQ15		:5;
				vu32 SQ16		:5;
				vu32 L			:4;		// Regular channel sequence No.
			};
		} SQR1;	// ADC regular sequence register 1
		
		union {
			vu32 Data;
			struct {
				vu32 SQ7		:5;
				vu32 SQ8		:5;
				vu32 SQ9		:5;
				vu32 SQ10		:5;
				vu32 SQ11		:5;
				vu32 SQ12		:5;
			};
		} SQR2;	// ADC regular sequence register 2
		
		union {
			vu32 Data;
			struct {
				vu32 SQ1		:5;
				vu32 SQ2		:5;
				vu32 SQ3		:5;
				vu32 SQ4		:5;
				vu32 SQ5		:5;
				vu32 SQ6		:5;
			};
		} SQR3;	// ADC regular sequence register 3

		union {
			vu32 Data;
			struct {
				vu32 JSQ1		:5;
				vu32 JSQ2		:5;
				vu32 JSQ3		:5;
				vu32 JSQ4		:5;
				vu32 JL			:2;
			};
		} JSQR;	// ADC injected sequence register(ADC_JSQR)

		vu32 JDR1;
		vu32 JDR2;
		vu32 JDR3;
		vu32 JDR4;
		vu32 DR;
	} __B;

} ADC_TypeDef;

typedef union
{
	struct
	{
		__IO uint32_t CSR;    /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
		__IO uint32_t CCR;    /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
		__IO uint32_t CDR;    /*!< ADC common regular data register for dual */
	};
	
	struct
	{
		union {
			vu32 Data;
			struct {
				vu32 AWD1		:1;	// Analog watchdog flag: 0: No Analog watchdog event occured
									// 						 1: Analog Watchdog event occured
				vu32 EOC1		:1;	// End of converstion	 0: conversion is not complete
									//						 1: conversion complete
				vu32 JEOC1		:1;	// injected channel end of conversion			
				vu32 JSTRT1		:1;	// injected channel start flag: 0: No Injected group converstion started
									//								1: Injected group converstion has started
				vu32 STRT1		:1;	// Regular channel start flag
				vu32 OVR1		:1;	// OverRun Flag
				vu32 			:2;
				
				vu32 AWD2		:1;	// Analog watchdog flag: 0: No Analog watchdog event occured
									// 						 1: Analog Watchdog event occured
				vu32 EOC2		:1;	// End of converstion	 0: conversion is not complete
									//						 1: conversion complete
				vu32 JEOC2		:1;	// injected channel end of conversion			
				vu32 JSTRT2		:1;	// injected channel start flag: 0: No Injected group converstion started
									//								1: Injected group converstion has started
				vu32 STRT2		:1;	// Regular channel start flag
				vu32 OVR2		:1;	// OverRun Flag
				vu32 			:2;

				vu32 AWD3		:1;	// Analog watchdog flag: 0: No Analog watchdog event occured
									// 						 1: Analog Watchdog event occured
				vu32 EOC3		:1;	// End of converstion	 0: conversion is not complete
									//						 1: conversion complete
				vu32 JEOC3		:1;	// injected channel end of conversion			
				vu32 JSTRT3		:1;	// injected channel start flag: 0: No Injected group converstion started
									//								1: Injected group converstion has started
				vu32 STRT3		:1;	// Regular channel start flag
				vu32 OVR3		:1;	// OverRun Flag

