dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/stm32f2xx_1212.h
typedef union {
	struct {
		__IO uint32_t ACR;      /*!< FLASH access control register, Address offset: 0x00 */
		__IO uint32_t KEYR;     /*!< FLASH key register,            Address offset: 0x04 */
		__IO uint32_t OPTKEYR;  /*!< FLASH option key register,     Address offset: 0x08 */
		__IO uint32_t SR;       /*!< FLASH status register,         Address offset: 0x0C */
		__IO uint32_t CR;       /*!< FLASH control register,        Address offset: 0x10 */
		__IO uint32_t OPTCR;    /*!< FLASH option control register, Address offset: 0x14 */
	};
	struct {
		union {
			vu32 Data;
			struct	{
				vu32 LATENCY		:3;	//rw, the ratio of the SYSCLK period to the Flash Access time
				vu32				:5;
				vu32 PRFTBE			:1;	//rw, Prefetch Buffer Enable
				vu32 ICEN			:1;	/*!< Instruction cache enable */
				vu32 DCEN			:1; /*!< Data cache enable 0: Data cache is disabled */
				vu32 ICRST			:1; /*!< Instruction cache reset */
				vu32 DCRST			:1; /*!< Data cache reset */
			};
		 } ACR;      				/*!< FLASH access control register, Address offset: 0x00 */

		vu32 KEYR;			     	/*!< FLASH key register,            Address offset: 0x04 */
		vu32 OPTKEYR;  				/*!< FLASH option key register,     Address offset: 0x08 */

		union {
			vu32 Data;
			struct	{
				vu32 EOP			:1;	//rw, End of operation
				vu32 OPERR			:1;	/*!< End of operation */
				vu32				:2;	/*!< Operation error */
				vu32 WRPERR			:1;	/*!< Write protection error */
				vu32 PGAERR			:1;	/*!< Programming alignment error */
				vu32 PGPERR			:1;	/*!< Programming parallelism error */
				vu32 PGSERR			:1;	/*!< Programming sequence error */
				vu32				:8;
				
				vu32 BSY			:1;		//rw, Busy
			};
		} SR;      				 	/*!< FLASH status register,         Address offset: 0x0C */

		union {
			vu32 Data;
			struct	{
				vu32 PG				:1;		//rw, Programming
				vu32 SER			:1;		//rw, Sector Erase
				vu32 MER			:1;		//rw, Mass Erase
				vu32 SNB			:4;		// Sector number
				vu32				:1;
				vu32 PSIZE			:2;		//rw, These bits select the program parallelism.
				vu32				:6;
				
				vu32 STRT			:1;		//rw, Start
				vu32 				:7;
				vu32 EOPIE			:1;		//rw, End of operation interrupt enable
				vu32 ERRIE			:1;		//rw, Error Interrupt Enable
				vu32 				:5;		//rw, Option Bytes Write Enable
				vu32 LOCK			:1;		/*< Write to 1 only. When it is set, this bit indicates that the FLASH_CR register is locked. */
			};
		} CR;       				/*!< FLASH control register,        Address offset: 0x10 */

		union {
			vu32 Data;
			struct	{
				vu32 OPTLOCK		:1;		/*!< Option lock */
				vu32 OPTSTRT		:1;		/*!< Option start */
				vu32 BOR_LEV		:2;		/*!< BOR reset Level */
				vu32				:1;
				vu32 WDG_SW			:1;
				vu32 nRST_STOP		:1;
				vu32 nRSTSTDBY		:1;		/*!< User option byte */
				vu32 RDP			:8;		/*!< Read protect */

				vu32 nWRP			:12;	/*!< Not write protect, 0: write protect!! */
			};
		} OPTCR;					/*!< FLASH option control register, Address offset: 0x14 */
	} __B;
} FLASH_TypeDef;

/** 
  * @brief Flexible Static Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */   
} FSMC_Bank1_TypeDef; 

/** 
  * @brief Flexible Static Memory Controller Bank1E
  */
  
typedef struct
{
  __IO uint32_t BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FSMC_Bank1E_TypeDef;

/** 
  * @brief Flexible Static Memory Controller Bank2
  */
  
typedef struct
{
  __IO uint32_t PCR2;       /*!< NAND Flash control register 2,                       Address offset: 0x60 */
  __IO uint32_t SR2;        /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
  __IO uint32_t PMEM2;      /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
  __IO uint32_t PATT2;      /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
  uint32_t      RESERVED0;  /*!< Reserved, 0x70                                                            */
  __IO uint32_t ECCR2;      /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
} FSMC_Bank2_TypeDef;

/** 
  * @brief Flexible Static Memory Controller Bank3
  */
  
typedef struct
{
  __IO uint32_t PCR3;       /*!< NAND Flash control register 3,                       Address offset: 0x80 */
  __IO uint32_t SR3;        /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
  __IO uint32_t PMEM3;      /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
  __IO uint32_t PATT3;      /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
  uint32_t      RESERVED0;  /*!< Reserved, 0x90                                                            */
  __IO uint32_t ECCR3;      /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} FSMC_Bank3_TypeDef;

/** 
  * @brief Flexible Static Memory Controller Bank4
  */
  
typedef struct
{
  __IO uint32_t PCR4;       /*!< PC Card  control register 4,                       Address offset: 0xA0 */
  __IO uint32_t SR4;        /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
  __IO uint32_t PMEM4;      /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
  __IO uint32_t PATT4;      /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
  __IO uint32_t PIO4;       /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */
} FSMC_Bank4_TypeDef; 

/** 
  * @brief General Purpose I/O
  */
typedef union{
	struct
	{
	  __IO uint32_t MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */
	  __IO uint32_t OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */
	  __IO uint32_t OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */
	  __IO uint32_t PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
	  __IO uint32_t IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */
	  __IO uint32_t ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */
	  __IO uint16_t BSRRL;    /*!< GPIO port bit set/reset low register,  Address offset: 0x18      */
	  __IO uint16_t BSRRH;    /*!< GPIO port bit set/reset high register, Address offset: 0x1A      */
	  __IO uint32_t LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
	  __IO uint32_t AFR[2];   /*!< GPIO alternate function registers,     Address offset: 0x24-0x28 */
	};
	
	struct
	{
		union {
			vu32 Data;
			struct{
				vu32 B0		:2;
				vu32 B1		:2;
				vu32 B2		:2;
				vu32 B3		:2;
				vu32 B4		:2;
				vu32 B5		:2;
				vu32 B6		:2;
				vu32 B7		:2;

				vu32 B8		:2;
				vu32 B9 	:2;
				vu32 B10 	:2;
				vu32 B11 	:2;
				vu32 B12 	:2;
				vu32 B13 	:2;
				vu32 B14 	:2;
				vu32 B15 	:2;
			};
		} MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */

		union {
			vu32 Data;
			struct{
				vu32 B0	  	:1;
				vu32 B1	  	:1;
				vu32 B2	  	:1;
				vu32 B3	  	:1;
				vu32 B4	  	:1;
				vu32 B5	  	:1;
				vu32 B6	  	:1;
				vu32 B7	  	:1;

