dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/stm32f2xx_1212.h
				vu32 B8	  	:1;
				vu32 B9	  	:1;
				vu32 B10	:1;
				vu32 B11	:1;
				vu32 B12	:1;
				vu32 B13	:1;
				vu32 B14	:1;
				vu32 B15	:1;
		  	};
		} OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */

		union {
		  vu32 Data;
		  struct{
				vu32 B0		:2;
				vu32 B1		:2;
				vu32 B2		:2;
				vu32 B3		:2;
				vu32 B4		:2;
				vu32 B5		:2;
				vu32 B6		:2;
				vu32 B7		:2;

				vu32 B8		:2;
				vu32 B9		:2;
				vu32 B10	:2;
				vu32 B11	:2;
				vu32 B12	:2;
				vu32 B13	:2;
				vu32 B14	:2;
				vu32 B15	:2;
		  	};
		} OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */

		union {
			vu32 Data;
			struct{
				vu32 B0		:2;
				vu32 B1		:2;
				vu32 B2		:2;
				vu32 B3		:2;
				vu32 B4		:2;
				vu32 B5		:2;
				vu32 B6		:2;
				vu32 B7		:2;

				vu32 B8		:2;
				vu32 B9		:2;
				vu32 B10	:2;
				vu32 B11	:2;
				vu32 B12	:2;
				vu32 B13	:2;
				vu32 B14	:2;
				vu32 B15	:2;
		  	};
		} PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */

		union {
			vu32 Data;
			struct{
				vu32 B0	  	:1;
				vu32 B1	  	:1;
				vu32 B2	  	:1;
				vu32 B3	  	:1;
				vu32 B4	  	:1;
				vu32 B5	  	:1;
				vu32 B6	  	:1;
				vu32 B7	  	:1;

				vu32 B8	  	:1;
				vu32 B9	  	:1;
				vu32 B10	:1;
				vu32 B11	:1;
				vu32 B12	:1;
				vu32 B13	:1;
				vu32 B14	:1;
				vu32 B15	:1;
		  	};
		} IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */

		union {
			vu32 Data;
			struct{
				vu32 B0	  	:1;
				vu32 B1	  	:1;
				vu32 B2	  	:1;
				vu32 B3	  	:1;
				vu32 B4	  	:1;
				vu32 B5	  	:1;
				vu32 B6	  	:1;
				vu32 B7	  	:1;

				vu32 B8	  	:1;
				vu32 B9	  	:1;
				vu32 B10	:1;
				vu32 B11	:1;
				vu32 B12	:1;
				vu32 B13	:1;
				vu32 B14	:1;
				vu32 B15	:1;
		  	};
		} ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */

		union {
			vu16 Data;
			struct{
				vu16 B0	  	:1;
				vu16 B1	  	:1;
				vu16 B2	  	:1;
				vu16 B3	  	:1;
				vu16 B4	  	:1;
				vu16 B5	  	:1;
				vu16 B6	  	:1;
				vu16 B7	  	:1;

				vu16 B8	  	:1;
				vu16 B9	  	:1;
				vu16 B10	:1;
				vu16 B11	:1;
				vu16 B12	:1;
				vu16 B13	:1;
				vu16 B14	:1;
				vu16 B15	:1;
		  	};
		} BSRRL;    /*!< GPIO port bit set/reset low register,  Address offset: 0x18      */

		union {
			vu16 Data;
			struct{
				vu16 B0	  	:1;
				vu16 B1	  	:1;
				vu16 B2	  	:1;
				vu16 B3	  	:1;
				vu16 B4	  	:1;
				vu16 B5	  	:1;
				vu16 B6	  	:1;
				vu16 B7	  	:1;

				vu16 B8	  	:1;
				vu16 B9	  	:1;
				vu16 B10	:1;
				vu16 B11	:1;
				vu16 B12	:1;
				vu16 B13	:1;
				vu16 B14	:1;
				vu16 B15	:1;
		  	};
		} BSRRH;    /*!< GPIO port bit set/reset high register, Address offset: 0x1A      */

		union {
			vu32 Data;
			struct{
				vu32 B0	  	:1;
				vu32 B1	  	:1;
				vu32 B2	  	:1;
				vu32 B3	  	:1;
				vu32 B4	  	:1;
				vu32 B5	  	:1;
				vu32 B6	  	:1;
				vu32 B7	  	:1;

				vu32 B8	  	:1;
				vu32 B9	  	:1;
				vu32 B10	:1;
				vu32 B11	:1;
				vu32 B12	:1;
				vu32 B13	:1;
				vu32 B14	:1;
				vu32 B15	:1;
			};
		} LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */

		union {
			vu32 Data[2];
			struct{
				vu32 B0	  	:4;
				vu32 B1	  	:4;
				vu32 B2	  	:4;
				vu32 B3	  	:4;
				vu32 B4	  	:4;
				vu32 B5	  	:4;
				vu32 B6	  	:4;
				vu32 B7	  	:4;

				vu32 B8	  	:4;
				vu32 B9	  	:4;
				vu32 B10	:4;
				vu32 B11	:4;
				vu32 B12	:4;
				vu32 B13	:4;
				vu32 B14	:4;
				vu32 B15	:4;
			};
		} AFR;   /*!< GPIO alternate function registers,     Address offset: 0x24-0x28 */
	} __B;

} GPIO_TypeDef;


/** 
  * @brief System configuration controller
  */
  
typedef struct
{
  __IO uint32_t MEMRMP;       /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
  __IO uint32_t PMC;          /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
  __IO uint32_t EXTICR[4];    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
  uint32_t      RESERVED[2];  /*!< Reserved, 0x18-0x1C                                                          */ 
  __IO uint32_t CMPCR;        /*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
} SYSCFG_TypeDef;

/** 
  * @brief Inter-integrated Circuit Interface
  */

typedef struct
{
  __IO uint16_t CR1;        /*!< I2C Control register 1,     Address offset: 0x00 */
  uint16_t      RESERVED0;  /*!< Reserved, 0x02                                   */
  __IO uint16_t CR2;        /*!< I2C Control register 2,     Address offset: 0x04 */
  uint16_t      RESERVED1;  /*!< Reserved, 0x06                                   */
  __IO uint16_t OAR1;       /*!< I2C Own address register 1, Address offset: 0x08 */
  uint16_t      RESERVED2;  /*!< Reserved, 0x0A                                   */
  __IO uint16_t OAR2;       /*!< I2C Own address register 2, Address offset: 0x0C */
  uint16_t      RESERVED3;  /*!< Reserved, 0x0E                                   */
  __IO uint16_t DR;         /*!< I2C Data register,          Address offset: 0x10 */
  uint16_t      RESERVED4;  /*!< Reserved, 0x12                                   */
  __IO uint16_t SR1;        /*!< I2C Status register 1,      Address offset: 0x14 */
  uint16_t      RESERVED5;  /*!< Reserved, 0x16                                   */
  __IO uint16_t SR2;        /*!< I2C Status register 2,      Address offset: 0x18 */
  uint16_t      RESERVED6;  /*!< Reserved, 0x1A                                   */
  __IO uint16_t CCR;        /*!< I2C Clock control register, Address offset: 0x1C */
  uint16_t      RESERVED7;  /*!< Reserved, 0x1E                                   */
  __IO uint16_t TRISE;      /*!< I2C TRISE register,         Address offset: 0x20 */
  uint16_t      RESERVED8;  /*!< Reserved, 0x22                                   */
} I2C_TypeDef;

/** 
  * @brief Independent WATCHDOG
  */

typedef struct
{
  __IO uint32_t KR;   /*!< IWDG Key register,       Address offset: 0x00 */
  __IO uint32_t PR;   /*!< IWDG Prescaler register, Address offset: 0x04 */
  __IO uint32_t RLR;  /*!< IWDG Reload register,    Address offset: 0x08 */
  __IO uint32_t SR;   /*!< IWDG Status register,    Address offset: 0x0C */
} IWDG_TypeDef;

/** 
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CR;   /*!< PWR power control register,        Address offset: 0x00 */
  __IO uint32_t CSR;  /*!< PWR power control/status register, Address offset: 0x04 */
} PWR_TypeDef;

/** 
  * @brief Reset and Clock Control
  */
typedef union{
	struct
	{
	  __IO uint32_t CR;            /*!< RCC clock control register,                                  Address offset: 0x00 */
	  __IO uint32_t PLLCFGR;       /*!< RCC PLL configuration register,                              Address offset: 0x04 */
	  __IO uint32_t CFGR;          /*!< RCC clock configuration register,                            Address offset: 0x08 */
	  __IO uint32_t CIR;           /*!< RCC clock interrupt register,                                Address offset: 0x0C */
	  __IO uint32_t AHB1RSTR;      /*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
	  __IO uint32_t AHB2RSTR;      /*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
	  __IO uint32_t AHB3RSTR;      /*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
	  uint32_t      RESERVED0;     /*!< Reserved, 0x1C                                                                    */
	  __IO uint32_t APB1RSTR;      /*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
	  __IO uint32_t APB2RSTR;      /*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
	  uint32_t      RESERVED1[2];  /*!< Reserved, 0x28-0x2C                                                               */
	  __IO uint32_t AHB1ENR;       /*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
	  __IO uint32_t AHB2ENR;       /*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
	  __IO uint32_t AHB3ENR;       /*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
	  uint32_t      RESERVED2;     /*!< Reserved, 0x3C                                                                    */
	  __IO uint32_t APB1ENR;       /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
	  __IO uint32_t APB2ENR;       /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
	  uint32_t      RESERVED3[2];  /*!< Reserved, 0x48-0x4C                                                               */
	  __IO uint32_t AHB1LPENR;     /*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
	  __IO uint32_t AHB2LPENR;     /*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
	  __IO uint32_t AHB3LPENR;     /*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
	  uint32_t      RESERVED4;     /*!< Reserved, 0x5C                                                                    */
	  __IO uint32_t APB1LPENR;     /*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
	  __IO uint32_t APB2LPENR;     /*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
	  uint32_t      RESERVED5[2];  /*!< Reserved, 0x68-0x6C                                                               */
	  __IO uint32_t BDCR;          /*!< RCC Backup domain control register,                          Address offset: 0x70 */
	  __IO uint32_t CSR;           /*!< RCC clock control & status register,                         Address offset: 0x74 */
	  uint32_t      RESERVED6[2];  /*!< Reserved, 0x78-0x7C                                                               */
	  __IO uint32_t SSCGR;         /*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
	  __IO uint32_t PLLI2SCFGR;    /*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */
	};
	struct {
		union {
			vu32 Data;				// 0x00
			struct	{
				vu32 HSION		:1; // rw, internal(8MHz) high speed clock enable, ON: 1, OFF:0
				vu32 HSIRDY 	:1; // r, internal high speed clock ready flag, ready: 1, Not Ready: 0
				vu32			:1;
				vu32 HSITRIM	:5; // rw, internal high speed clock trimming(adjust calibration)
				vu32 HSICAL 	:8; // r, interanl high speed clok calibration
				vu32 HSEON		:1; // rw, external(1~25Mhz) high speed clock enable, ON: 1, OFF: 0
				vu32 HSERDY 	:1; // r, external(1~25Mhz) high speed clock ready flag, ready(1), not reday(1)
				vu32 HSEBYP 	:1; // rw, external(1~25Mhz) high speed clock Bypass 0: not bypass, 1: bypass
				vu32 CSSON		:1; // rw, Clock Security System Enable: if)Ext osc is, Set: 1, else 0:
				vu32			:4;
				vu32 PLLON		:1; // rw, PLL enable, 1: PLL ON, 0: PLL OFF
				vu32 PLLRDY 	:1; // r, PLL clock ready flag, 0: PLL unlocked, 1: PLL locked
				vu32 PLLI2SON	:1; // rw, PLLI2S Enable
				vu32 PLLI2SRDY	:1;	// r, PLLI2S clock ready flag
			};
		} CR; 						/*!< RCC clock control register,								   Address offset: 0x00 */

		union {
			vu32 Data;				// 0x04
			struct {
				vu32 PLLM 		:6; // rw, division factor for the main PLL and audio PLL (PLLi2s) input clock
				vu32 PLLN		:8; // rw, main pll multiplication factor for vco
				vu32 			:1; 				

				vu32 PLLP		:2; // rw, main pll division factor for main system clock
				vu32 			:4; // 
				vu32 PLLSRC 	:1; // rw, 0: HSI, 1: HSE
				vu32 		 	:1; //
				vu32 PLLQ		:4; // rw, main pll divistion factor for usb otg FS, SDIO and random number generator
 			};
		} PLLCFGR;		 			/*!< RCC PLL configuration register,							   Address offset: 0x04 */

