dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/stm32f2xx_1212.h
		union{
			vu32 Data;				// 0x08
			struct {
				vu32 SW			:2;
				vu32 SWS		:2;
				vu32 HPRE		:4;
				vu32 			:2;
				vu32 PPRE1		:3;
				vu32 PPRE2		:3;
				
				vu32 RTCPRE		:5;
				vu32 MCO1		:2;
				vu32 I2SSCR		:1;
				vu32 MCO1PRE	:3;
				vu32 MCO2PRE	:3;
				vu32 MCO2		:2;
			};
		} CFGR; 					/*!< RCC clock configuration register, 							   Address offset: 0x08 */

		__IO uint32_t CIR;			/*!< RCC clock interrupt register, 							   		Address offset: 0x0C */

		union{
			vu32 Data;
			struct {
				vu32 IOPARST	:1;
				vu32 IOPBRST	:1;
				vu32 IOPCRST	:1;
				vu32 IOPDRST	:1;
				vu32 IOPERST	:1;
				vu32 IOPFRST	:1;
				vu32 IOPGRST	:1;
				vu32 IOPHRST	:1;
				vu32 IOPIRST	:1;
				vu32 			:3;
				vu32 CRCRST		:1;
				vu32			:3;

				vu32			:5;
				vu32 DMA1RST	:1;
				vu32 DMA2RST	:1;
				vu32			:2;
				vu32 ETHMACRST	:1;
				vu32			:3;
				vu32 OTGHSRST	:1;
			};
		} AHB1RSTR; 	 			/*!< RCC AHB1 peripheral reset register,						   Address offset: 0x10 */

		union{
			vu32 Data;
			struct {
				vu32 DCMIRST	:1;
				vu32			:3;
				vu32 CRYPRST	:1;
				vu32 HASHRST	:1;
				vu32 RNGRST		:1;
				vu32 OTGFSRST	:1;
			};
		} AHB2RSTR; 	 			/*!< RCC AHB2 peripheral reset register,						   Address offset: 0x14 */

		union{
			vu32 Data;
			struct {
				vu32 FSMCRST	:1;
			};		
		} AHB3RSTR; 	 			/*!< RCC AHB3 peripheral reset register,						   Address offset: 0x18 */

		uint32_t	  RESERVED0;	/*!< Reserved, 0x1C																		*/

		union{
			vu32 Data;
			struct {
				vu32 TIM2RST	:1;
				vu32 TIM3RST	:1;
				vu32 TIM4RST	:1;
				vu32 TIM5RST	:1;
				vu32 TIM6RST	:1;
				vu32 TIM7RST	:1;
				vu32 TIM12RST	:1;
				vu32 TIM13RST	:1;
				vu32 TIM14RST	:1;
				vu32			:2;
				vu32 WWDGRST	:1;
				vu32			:2;
				vu32 SPI2RST	:1;
				vu32 SPI1RST	:1;

				vu32			:1;
				vu32 USART2RST	:1;
				vu32 USART3RST	:1;
				vu32 UART4RST	:1;
				vu32 UART5RST	:1;
				vu32 I2C1RST	:1;
				vu32 I2C2RST	:1;
				vu32 I2C3RST	:1;
				vu32			:1;
				vu32 CAN1RST	:1;
				vu32 CAN2RST	:1;
				vu32			:1;
				vu32 PWRRST		:1;
				vu32 DACRST		:1;
			};		
		} APB1RSTR; 	 			/*!< RCC APB1 peripheral reset register,						   Address offset: 0x20 */

		union{
			vu32 Data;
			struct {
				vu32 TIM1RST	:1;
				vu32 TIM8RST	:1;
				vu32			:2;
				vu32 USART1RST	:1;
				vu32 USART6RST	:1;
				vu32 			:2;
				vu32 ADCRST		:1;
				vu32			:2;
				vu32 SDIORST	:1;
				vu32 SPI1RST	:1;
				vu32			:1;
				vu32 SYSCFGRST	:1;
				vu32			:1;

				vu32 TIM9RST	:1;
				vu32 TIM10RST	:1;
				vu32 TIM11RST	:1;
			};
		} APB2RSTR; 	 			/*!< RCC APB2 peripheral reset register,						   Address offset: 0x24 */

		uint32_t	  RESERVED1[2]; /*!< Reserved, 0x28-0x2C																*/

		union{
			vu32 Data;
			struct {
				vu32 IOPAEN		:1;
				vu32 IOPBEN		:1;
				vu32 IOPCEN		:1;
				vu32 IOPDEN		:1;
				vu32 IOPEEN		:1;
				vu32 IOPFEN		:1;
				vu32 IOPGEN		:1;
				vu32 IOPHEN		:1;
				vu32 IOPIEN		:1;
				vu32 			:3;
				vu32 CRCEN		:1;
				vu32			:3;

				vu32			:2;
				vu32 BKPSRAMEN	:1;
				vu32			:2;
				vu32 DMA1EN		:1;
				vu32 DMA2EN		:1;
				vu32			:2;
				vu32 ETHMACEN	:1;
				vu32 ETHMACTXEN	:1;
				vu32 ETHMACRSEN	:1;
				vu32 ETHMACPTPEN:1;
				vu32 OTGHSEN	:1;
				vu32 OTGHSULPIEN:1;
			};
		} AHB1ENR;					/*!< RCC AHB1 peripheral clock register,						   Address offset: 0x30 */

		union{
			vu32 Data;
			struct {
				vu32 DCMIEN		:1;
				vu32			:3;
				vu32 CRYPEN		:1;
				vu32 HASHEN		:1;
				vu32 RNGEN		:1;
				vu32 OTGFSEN	:1;
			};
		} AHB2ENR;		 			/*!< RCC AHB2 peripheral clock register,						   Address offset: 0x34 */

		union{
			vu32 Data;
			struct {
				vu32 FSMCEN		:1;
			};
		} AHB3ENR;		 			/*!< RCC AHB3 peripheral clock register,						   Address offset: 0x38 */

		uint32_t	  RESERVED2;	/*!< Reserved, 0x3C																		*/
		
		union{
			vu32 Data;
			struct {
				vu32 TIM2EN		:1;
				vu32 TIM3EN		:1;
				vu32 TIM4EN		:1;
				vu32 TIM5EN		:1;
				vu32 TIM6EN		:1;
				vu32 TIM7EN		:1;
				vu32 TIM12EN	:1;
				vu32 TIM13EN	:1;
				vu32 TIM14EN	:1;
				vu32			:2;
				vu32 WWDGEN		:1;
				vu32 			:2;
				vu32 SPI2EN		:1;
				vu32 SPI3EN		:1;
				
				vu32 			:1;
				vu32 USART2EN	:1;
				vu32 USART3EN	:1;
				vu32 UART4EN	:1;
				vu32 UART5EN	:1;
				vu32 I2C1EN		:1;
				vu32 I2C2EN		:1;
				vu32 I2C3EN		:1;
				vu32			:1;
				vu32 CAN1EN		:1;
				vu32 CAN2EN		:1;
				vu32			:1;
				vu32 PWREN		:1;
				vu32 DACEN		:1;
			};
		} APB1ENR;		 			/*!< RCC APB1 peripheral clock enable register,				   Address offset: 0x40 */

		union{
			vu32 Data;
			struct {
				vu32 TIM1EN		:1;
				vu32 TIM8EN		:1;
				vu32			:2;
				vu32 USART1EN	:1;
				vu32 USART6EN	:1;
				vu32			:2;
				vu32 ADC1EN		:1;
				vu32 ADC2EN		:1;
				vu32 ADC3EN		:1;
				vu32 SDIOEN		:1;
				vu32 SPI1EN		:1;
				vu32			:1;
				vu32 SYSCFGEN	:1;
				vu32 			:1;
				
				vu32 TIM9EN		:1;
				vu32 TIM10EN	:1;
				vu32 TIM11EN	:1;
			};
		} APB2ENR;		 			/*!< RCC APB2 peripheral clock enable register,				   Address offset: 0x44 */

		uint32_t	  RESERVED3[2]; /*!< Reserved, 0x48-0x4C																*/

		union{
			vu32 Data;
			struct {
				vu32 IOPAEN		:1;
				vu32 IOPBEN		:1;
				vu32 IOPCEN		:1;
				vu32 IOPDEN		:1;
				vu32 IOPEEN		:1;
				vu32 IOPFEN		:1;
				vu32 IOPGEN		:1;
				vu32 IOPHEN		:1;
				vu32 IOPIEN		:1;
				vu32 			:3;
				vu32 CRCEN		:1;
				vu32			:2;
				vu32 FLITFLPEN	:1;

				vu32 SRAM1EN	:1;
				vu32 SRAM2EN	:1;
				vu32 BKPSRAMEN	:1;
				vu32			:2;
				vu32 DMA1EN		:1;
				vu32 DMA2EN		:1;
				vu32			:2;
				vu32 ETHMACEN	:1;
				vu32 ETHMACTXEN	:1;
				vu32 ETHMACRSEN	:1;
				vu32 ETHMACPTPEN:1;
				vu32 OTGHSEN	:1;
				vu32 OTGHSULPIEN:1;
			};
		} AHB1LPENR;	 			/*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */

		union{
			vu32 Data;
			struct {
				vu32 DCMIEN		:1;
				vu32			:3;
				vu32 CRYPEN		:1;
				vu32 HASHEN		:1;
				vu32 RNGEN		:1;
				vu32 OTGFSEN	:1;
			};
		} AHB2LPENR;	 			/*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */

		union{
			vu32 Data;
			struct {
				vu32 FSMCEN		:1;
			};
		} AHB3LPENR;	 			/*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
		
		uint32_t	  RESERVED4;	 /*!< Reserved, 0x5C																	*/

