dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/stm32f2xx_1212.h
	struct {
		union{
			vu32 Data;
			struct	{
				vu32 PE		:1;	//Parity Error
				vu32 FE		:1;	//Framing Error
				vu32 NE		:1;	//Noise Error Flag
				vu32 ORE	:1;	//OverRun Error
				vu32 IDLE	:1; //IDLE line detected
				vu32 RXNE	:1; //Read Data Register Not Empty
				vu32 TC		:1; //Transmission Complete
				vu32 TXE	:1; //Transmit Data Register Empty
				vu32 LBD	:1; //LIN Break Detecting Flag
				vu32 CTS	:1; //CTS Flag
			};
		} SR;	//Status register
		
		union{
			vu32 Data;
			struct	{
				vu32 DR		:9;	//Data value
			};
		} DR;	//Data register

		union{
			vu32 Data;
			struct	{
				vu32 DIV_Fracton	:4;		//fraction of DIV
				vu32 DIV_Mantissa	:12;	//mantissa of DIV
			} Bit;
		} BRR;	//Baud rate register

		union{
			vu32 Data;
			struct	{
				vu32 SBK		:1;	//Send Break
				vu32 RWU		:1;	//Receiver Wake-Up
				vu32 RE			:1;	//Receiver Enable
				vu32 TE			:1;	//Transmitter Enable
				vu32 IDLEIE		:1; //IDLE Interrupt Enable
				vu32 RXNEIE		:1;	//RXNE Interrupt Enable
				vu32 TCIE		:1; //Transmission Complete Interrupt Enable
				vu32 TXEIE		:1;	//TXE Interrupt Enable
				vu32 PEIE		:1;	//PE Interrupt Enable
				vu32 PS			:1; //Parity Selection
				vu32 PCE		:1;	//Parity Control Enable
				vu32 WAKE		:1;	//Wake-up method
				vu32 M			:1;	//word length
				vu32 UE			:1;	//USART Enable
				vu32			:1;
				vu32 OVER8		:1;	//OverSampling mode
			};
		} CR1; //Control register1

		union{
			vu32 Data;
			struct	{
				vu32 ADD		:4;	//Address of the USART node
				vu32 			:1;	
				vu32 LBDL		:1;	//LIN Break Detection Length
				vu32 LBDIE		:1;	//LIN Break Detection Interrupt Enalbe
				vu32 			:1;	
				vu32 LBCL		:1;	//Last Bit Clock pulse
				vu32 CPHA		:1;	//Clock Phase
				vu32 CPOL		:1;	//Clock Polarity
				vu32 CLKEN		:1;	//Clock Enable
				vu32 STOP		:2;	//STOP bits
				vu32 LINEN		:1;	//LIN mode enable	
			};
		} CR2;	//Control register2

		union{
			vu32 Data;
			struct	{
				vu32 EIE		:1;	//Error Interrupt Enalbe
				vu32 IREN		:1;	//IrDA mode Enalbe
				vu32 IRLP		:1;	//IrDA Low-Power
				vu32 HDSEL		:1;	//Half-Duplex Selection
				vu32 NACK		:1;	//Smartcard NACK enalbe
				vu32 SCEN		:1;	//Smartcard mode enalbe
				vu32 DMAR		:1;	//DMA Enable Receiver
				vu32 DMAT		:1;	//DMA Enalbe Transmitter
				vu32 RTSE		:1;	//RTS Enalbe
				vu32 CTSE		:1;	//CTS Enalbe
				vu32 CTSIE		:1;	//CTS Interrupt Enalbe
				vu32 ONEBIT		:1;	//One sample bit method enable
			};
		} CR3;	//Control register3
			
		union{
			vu32 Data;
			struct	{
				vu32 PSC	:8;	//Prescaler value
				vu32 GT		:8;	//Guard time value
			} Bit;
		} GTPR;	//Guard time and prescaler register 
	} __B;
} USART_TypeDef;




/** 
  * @brief Window WATCHDOG
  */

typedef struct
{
  __IO uint32_t CR;   /*!< WWDG Control register,       Address offset: 0x00 */
  __IO uint32_t CFR;  /*!< WWDG Configuration register, Address offset: 0x04 */
  __IO uint32_t SR;   /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/** 
  * @brief Crypto Processor
  */

typedef struct
{
  __IO uint32_t CR;     /*!< CRYP control register,                            Address offset: 0x00 */
  __IO uint32_t SR;     /*!< CRYP status register,                             Address offset: 0x04 */
  __IO uint32_t DR;     /*!< CRYP data input register,                         Address offset: 0x08 */
  __IO uint32_t DOUT;   /*!< CRYP data output register,                        Address offset: 0x0C */
  __IO uint32_t DMACR;  /*!< CRYP DMA control register,                        Address offset: 0x10 */
  __IO uint32_t IMSCR;  /*!< CRYP interrupt mask set/clear register,           Address offset: 0x14 */
  __IO uint32_t RISR;   /*!< CRYP raw interrupt status register,               Address offset: 0x18 */
  __IO uint32_t MISR;   /*!< CRYP masked interrupt status register,            Address offset: 0x1C */
  __IO uint32_t K0LR;   /*!< CRYP key left  register 0,                        Address offset: 0x20 */
  __IO uint32_t K0RR;   /*!< CRYP key right register 0,                        Address offset: 0x24 */
  __IO uint32_t K1LR;   /*!< CRYP key left  register 1,                        Address offset: 0x28 */
  __IO uint32_t K1RR;   /*!< CRYP key right register 1,                        Address offset: 0x2C */
  __IO uint32_t K2LR;   /*!< CRYP key left  register 2,                        Address offset: 0x30 */
  __IO uint32_t K2RR;   /*!< CRYP key right register 2,                        Address offset: 0x34 */
  __IO uint32_t K3LR;   /*!< CRYP key left  register 3,                        Address offset: 0x38 */
  __IO uint32_t K3RR;   /*!< CRYP key right register 3,                        Address offset: 0x3C */
  __IO uint32_t IV0LR;  /*!< CRYP initialization vector left-word  register 0, Address offset: 0x40 */
  __IO uint32_t IV0RR;  /*!< CRYP initialization vector right-word register 0, Address offset: 0x44 */
  __IO uint32_t IV1LR;  /*!< CRYP initialization vector left-word  register 1, Address offset: 0x48 */
  __IO uint32_t IV1RR;  /*!< CRYP initialization vector right-word register 1, Address offset: 0x4C */
} CRYP_TypeDef;

/** 
  * @brief HASH
  */
  
typedef struct 
{
  __IO uint32_t CR;        /*!< HASH control register,          Address offset: 0x00        */
  __IO uint32_t DIN;       /*!< HASH data input register,       Address offset: 0x04        */
  __IO uint32_t STR;       /*!< HASH start register,            Address offset: 0x08        */
  __IO uint32_t HR[5];     /*!< HASH digest registers,          Address offset: 0x0C-0x1C   */
  __IO uint32_t IMR;       /*!< HASH interrupt enable register, Address offset: 0x20        */
  __IO uint32_t SR;        /*!< HASH status register,           Address offset: 0x24        */
  uint32_t  RESERVED[52];  /*!< Reserved, 0x28-0xF4                                         */
  __IO uint32_t CSR[51];   /*!< HASH context swap registers,    Address offset: 0x0F8-0x1C0 */  
} HASH_TypeDef;

/** 
  * @brief HASH
  */
  
typedef struct 
{
  __IO uint32_t CR;  /*!< RNG control register, Address offset: 0x00 */
  __IO uint32_t SR;  /*!< RNG status register,  Address offset: 0x04 */
  __IO uint32_t DR;  /*!< RNG data register,    Address offset: 0x08 */
} RNG_TypeDef;

/**
  * @}
  */
  
/** @addtogroup Peripheral_memory_map
  * @{
  */

